[
{"text": "I’ve seen a lot of bad reviews for this phone based on issues with the seller. Granted, some of those reviews say it took a few weeks for the problems to appear so I’ll edit this if that happens, but wow was I happy with what I got. Not only did it come with a charger (there’s some debate on that in other reviews), but it even had a clear bumper case. That was neither expected nor necessary but I appreciated it (I bought a Unicorn Beetle case which I have used and loved before on other phones). There wasn’t a scratch on this phone and it started working right away for me. The battery seems to be holding up fine. All in all I’d say this seems like a steal. If it self destructs on me in the next few weeks I’ll update this.UPDATE: It's been a few months and a trip overseas since I wrote that initial review, and it remains a solid decision I'm very happy with.", "rating": "5.0 out of 5 stars"},
{"text": "The iPhone 7 I purchased was \"certified refurbished\" and labeled as \"new\" quality but doesn't work. The phone looks great, but when I first turned it on it was in a restart loop. This was a bad sign to begin with, but I gave it the benefit of the doubt and connected it to my computer. When I finally got it to restore to factory settings, the screen started glitching to the point where there was nothing to stop it, and if it did get to the startup screen, it was non-responsive.The shipping took a few days, but at least it came when scheduled.I have been unable to make contact with the company, but I will update my review if they are able to fix the issue and if I receive a working phone.Update: Ended up returning the phone and purchasing elsewhere. The company was cooperative with the return. Of course this could have been a one-off issue", "rating": "1.0 out of 5 stars"},
{"text": "It’s a scam!!  The screen doesn’t respond properly so and the battery dies within one hour.  I highly  recommend that NO ONE gets this product and it should be taken off Amazon immediately. I don’t want everyone to make the same mistake I did by buying this horrible product.", "rating": "1.0 out of 5 stars"},
{"text": "I am very disappointed!!! I've ordered and had success with a previous refurbished phone.  However, this iphone 7 with 128 GB was stated as unlocked, which it was.  It was stated that it was Verizon compatible.  It clearly was not.  The Verizon techs stated that the system on this phone had to be from another country whose systems are totally incompatible with US carrier systems.  We spent hours at the Verizon store just to have to purchase a brand new phone from them.  I watched.  They tried everything to make my refurbished work.  Very frustrated and never doing this refurbished phone thing again.", "rating": "1.0 out of 5 stars"},
{"text": "This phone is not Verizon compatible! The side of the package says UNLK/T-Mobile. Tried to activate it anyways and it couldn't be.", "rating": "1.0 out of 5 stars"},
{"text": "Returning. For one, it was not an unlocked phone. I've had it for a month and the screen has started going black every few minutes, and sometimes it freaks out and tells me I have no way to connect to wifi or cell coverage (despite being somewhere with wifi and usually 4G). I'm returning before the problems escalate.Note- it doesn't come with a charger or with headphones.", "rating": "1.0 out of 5 stars"},
{"text": "This arrived 2 DAYS after I ordered it. It came much earlier than expected which is amazing! I see many reviews that say it isn't compatible with different networks but it worked perfectly when I activated it with Sprint. And despite its price it works great! It's not slow and the battery doesn't drain too quickly or anything like that. I, honestly, highly recommend this product!! 5 Stars all the way!", "rating": "5.0 out of 5 stars"},
{"text": "I bought this phone based off carrier compatibility. It is clearly stated that this phone will work with Verizon Wireless. After 2 hours on the phone with tech support, they finally let us know that this (t-moble) phone will only work on the (t-mobile and ATT) networks.", "rating": "1.0 out of 5 stars"},
{"text": "Before I even turned it on I tried to put it in a case and saw that the screen had popped out of the casing. The phone wouldn't turn on so I tried to charge it. The cable was loose in the charging port and the phone never powered on!!", "rating": "1.0 out of 5 stars"},
{"text": "The phone arrived in great condition without 1 scratch. However, the description that this phone was compatible with Verizon was not true", "rating": "1.0 out of 5 stars"}
][
,
,
,
,
,
,
,
